FrameworkComputer/EmbeddedController/chip/stm32/registers-stm32h7.h
#define STM32_RCC_CR REG32(STM32_RCC_BASE + 0x000)
#define STM32_RCC_ICSCR REG32(STM32_RCC_BASE + 0x004)
#define STM32_RCC_CRRCR REG32(STM32_RCC_BASE + 0x008)
#define STM32_RCC_CFGR REG32(STM32_RCC_BASE + 0x010)
#define STM32_RCC_D1CFGR REG32(STM32_RCC_BASE + 0x018)
#define STM32_RCC_D2CFGR REG32(STM32_RCC_BASE + 0x01C)
#define STM32_RCC_D3CFGR REG32(STM32_RCC_BASE + 0x020)
#define STM32_RCC_PLLCKSELR REG32(STM32_RCC_BASE + 0x028)
#define STM32_RCC_PLLCFGR REG32(STM32_RCC_BASE + 0x02C)
#define STM32_RCC_PLL1DIVR REG32(STM32_RCC_BASE + 0x030)
#define STM32_RCC_PLL1FRACR REG32(STM32_RCC_BASE + 0x034)
#define STM32_RCC_PLL2DIVR REG32(STM32_RCC_BASE + 0x038)
#define STM32_RCC_PLL2FRACR REG32(STM32_RCC_BASE + 0x03C)
#define STM32_RCC_PLL3DIVR REG32(STM32_RCC_BASE + 0x040)
#define STM32_RCC_PLL3FRACR REG32(STM32_RCC_BASE + 0x044)
#define STM32_RCC_D1CCIPR REG32(STM32_RCC_BASE + 0x04C)
#define STM32_RCC_D2CCIP1R REG32(STM32_RCC_BASE + 0x050)
#define STM32_RCC_D2CCIP2R REG32(STM32_RCC_BASE + 0x054)
#define STM32_RCC_D3CCIPR REG32(STM32_RCC_BASE + 0x058)
#define STM32_RCC_CIER REG32(STM32_RCC_BASE + 0x060)
#define STM32_RCC_CIFR REG32(STM32_RCC_BASE + 0x064)
#define STM32_RCC_CICR REG32(STM32_RCC_BASE + 0x068)
#define STM32_RCC_BDCR REG32(STM32_RCC_BASE + 0x070)
#define STM32_RCC_CSR REG32(STM32_RCC_BASE + 0x074)

#define STM32_RCC_APB2RSTR REG32(STM32_RCC_BASE + 0x098)

#define STM32_RCC_RSR REG32(STM32_RCC_BASE + 0x0D0)
#define STM32_RCC_AHB3ENR REG32(STM32_RCC_BASE + 0x0D4)
#define STM32_RCC_AHB1ENR REG32(STM32_RCC_BASE + 0x0D8)
#define STM32_RCC_AHB2ENR REG32(STM32_RCC_BASE + 0x0DC)
#define STM32_RCC_AHB2ENR_RNGEN BIT(6)
#define STM32_RCC_AHB2ENR_HASHEN BIT(5)
#define STM32_RCC_AHB2ENR_CRYPTEN BIT(4)
#define STM32_RCC_AHB4ENR REG32(STM32_RCC_BASE + 0x0E0)
#define STM32_RCC_AHB4ENR_GPIOMASK 0x3ff
#define STM32_RCC_APB3ENR REG32(STM32_RCC_BASE + 0x0E4)
#define STM32_RCC_APB1LENR REG32(STM32_RCC_BASE + 0x0E8)
#define STM32_RCC_APB1HENR REG32(STM32_RCC_BASE + 0x0EC)
#define STM32_RCC_APB2ENR REG32(STM32_RCC_BASE + 0x0F0)
#define STM32_RCC_APB4ENR REG32(STM32_RCC_BASE + 0x0F4)
#define STM32_RCC_SYSCFGEN BIT(1)
#define STM32_RCC_AHB3LPENR REG32(STM32_RCC_BASE + 0x0FC)
#define STM32_RCC_AHB1LPENR REG32(STM32_RCC_BASE + 0x100)
#define STM32_RCC_AHB2LPENR REG32(STM32_RCC_BASE + 0x104)
#define STM32_RCC_AHB4LPENR REG32(STM32_RCC_BASE + 0x108)
#define STM32_RCC_APB3LPENR REG32(STM32_RCC_BASE + 0x10C)
#define STM32_RCC_APB1LLPENR REG32(STM32_RCC_BASE + 0x110)
#define STM32_RCC_APB1HLPENR REG32(STM32_RCC_BASE + 0x114)
#define STM32_RCC_APB2LPENR REG32(STM32_RCC_BASE + 0x118)
#define STM32_RCC_APB4LPENR REG32(STM32_RCC_BASE + 0x11C)
/* Aliases */
#define STM32_RCC_APB1ENR STM32_RCC_APB1LENR

#define STM32_RCC_CR_HSION BIT(0)
#define STM32_RCC_CR_HSIRDY BIT(2)
#define STM32_RCC_CR_CSION BIT(7)
#define STM32_RCC_CR_CSIRDY BIT(8)
#define STM32_RCC_CR_HSI48ON BIT(12)
#define STM32_RCC_CR_HSI48RDY BIT(13)
#define STM32_RCC_CR_PLL1ON BIT(24)
#define STM32_RCC_CR_PLL1RDY BIT(25)
#define STM32_RCC_CR_PLL2ON BIT(26)
#define STM32_RCC_CR_PLL2RDY BIT(27)
#define STM32_RCC_CR_PLL3ON BIT(28)
#define STM32_RCC_CR_PLL3RDY BIT(29)
#define STM32_RCC_CFGR_SW_HSI (0 << 0)
#define STM32_RCC_CFGR_SW_CSI (1 << 0)
#define STM32_RCC_CFGR_SW_HSE (2 << 0)
#define STM32_RCC_CFGR_SW_PLL1 (3 << 0)
#define STM32_RCC_CFGR_SW_MASK (3 << 0)
#define STM32_RCC_CFGR_SWS_HSI (0 << 3)
#define STM32_RCC_CFGR_SWS_CSI (1 << 3)
#define STM32_RCC_CFGR_SWS_HSE (2 << 3)
#define STM32_RCC_CFGR_SWS_PLL1 (3 << 3)
#define STM32_RCC_CFGR_SWS_MASK (3 << 3)
#define STM32_RCC_D1CFGR_HPRE_DIV1 (0 << 0)
#define STM32_RCC_D1CFGR_HPRE_DIV2 (8 << 0)
#define STM32_RCC_D1CFGR_HPRE_DIV4 (9 << 0)
#define STM32_RCC_D1CFGR_HPRE_DIV8 (10 << 0)
#define STM32_RCC_D1CFGR_HPRE_DIV16 (11 << 0)
#define STM32_RCC_D1CFGR_D1PPRE_DIV1 (0 << 4)
#define STM32_RCC_D1CFGR_D1PPRE_DIV2 (4 << 4)
#define STM32_RCC_D1CFGR_D1PPRE_DIV4 (5 << 4)
#define STM32_RCC_D1CFGR_D1PPRE_DIV8 (6 << 4)
#define STM32_RCC_D1CFGR_D1PPRE_DIV16 (7 << 4)
#define STM32_RCC_D1CFGR_D1CPRE_DIV1 (0 << 8)
#define STM32_RCC_D1CFGR_D1CPRE_DIV2 (8 << 8)
#define STM32_RCC_D1CFGR_D1CPRE_DIV4 (9 << 8)
#define STM32_RCC_D1CFGR_D1CPRE_DIV8 (10 << 8)
#define STM32_RCC_D1CFGR_D1CPRE_DIV16 (1BIT(8))
#define STM32_RCC_PLLCKSEL_PLLSRC_HSI (0 << 0)
#define STM32_RCC_PLLCKSEL_PLLSRC_CSI (1 << 0)
#define STM32_RCC_PLLCKSEL_PLLSRC_HSE (2 << 0)
#define STM32_RCC_PLLCKSEL_PLLSRC_NONE (3 << 0)
#define STM32_RCC_PLLCKSEL_PLLSRC_MASK (3 << 0)
#define STM32_RCC_PLLCKSEL_DIVM1(m) ((m) << 4)
#define STM32_RCC_PLLCKSEL_DIVM2(m) ((m) << 12)
#define STM32_RCC_PLLCKSEL_DIVM3(m) ((m) << 20)
#define STM32_RCC_PLLCFG_PLL1VCOSEL_FRACEN BIT(0)
#define STM32_RCC_PLLCFG_PLL1VCOSEL_WIDE (0 << 1)
#define STM32_RCC_PLLCFG_PLL1VCOSEL_MEDIUM BIT(1)
#define STM32_RCC_PLLCFG_PLL1RGE_1M_2M (0 << 2)
#define STM32_RCC_PLLCFG_PLL1RGE_2M_4M (1 << 2)
#define STM32_RCC_PLLCFG_PLL1RGE_4M_8M (2 << 2)
#define STM32_RCC_PLLCFG_PLL1RGE_8M_16M (3 << 2)
#define STM32_RCC_PLLCFG_DIVP1EN BIT(16)
#define STM32_RCC_PLLCFG_DIVQ1EN BIT(17)
#define STM32_RCC_PLLCFG_DIVR1EN BIT(18)
#define STM32_RCC_PLLDIV_DIVN(n) (((n)-1) << 0)
#define STM32_RCC_PLLDIV_DIVP(p) (((p)-1) << 9)
#define STM32_RCC_PLLDIV_DIVQ(q) (((q)-1) << 16)
#define STM32_RCC_PLLDIV_DIVR(r) (((r)-1) << 24)
#define STM32_RCC_PLLFRAC(n) ((n) << 3)
#define STM32_RCC_D2CCIP1R_SPI123SEL_PLL1Q (0 << 12)
#define STM32_RCC_D2CCIP1R_SPI123SEL_PLL2P (1 << 12)
#define STM32_RCC_D2CCIP1R_SPI123SEL_PLL3P (2 << 12)
#define STM32_RCC_D2CCIP1R_SPI123SEL_I2SCKIN (3 << 12)
#define STM32_RCC_D2CCIP1R_SPI123SEL_PERCK (4 << 12)
#define STM32_RCC_D2CCIP1R_SPI123SEL_MASK (7 << 12)
#define STM32_RCC_D2CCIP1R_SPI45SEL_APB (0 << 16)
#define STM32_RCC_D2CCIP1R_SPI45SEL_PLL2Q (1 << 16)
#define STM32_RCC_D2CCIP1R_SPI45SEL_PLL3Q (2 << 16)
#define STM32_RCC_D2CCIP1R_SPI45SEL_HSI (3 << 16)
#define STM32_RCC_D2CCIP1R_SPI45SEL_CSI (4 << 16)
#define STM32_RCC_D2CCIP1R_SPI45SEL_HSE (5 << 16)
#define STM32_RCC_D2CCIP1R_SPI45SEL_MASK (7 << 16)
#define STM32_RCC_D2CCIP2_USART234578SEL_PCLK (0 << 0)
#define STM32_RCC_D2CCIP2_USART234578SEL_PLL2Q (1 << 0)
#define STM32_RCC_D2CCIP2_USART234578SEL_PLL3Q (2 << 0)
#define STM32_RCC_D2CCIP2_USART234578SEL_HSI (3 << 0)
#define STM32_RCC_D2CCIP2_USART234578SEL_CSI (4 << 0)
#define STM32_RCC_D2CCIP2_USART234578SEL_LSE (5 << 0)
#define STM32_RCC_D2CCIP2_USART234578SEL_MASK (7 << 0)
#define STM32_RCC_D2CCIP2_USART16SEL_PCLK (0 << 3)
#define STM32_RCC_D2CCIP2_USART16SEL_PLL2Q (1 << 3)
#define STM32_RCC_D2CCIP2_USART16SEL_PLL3Q (2 << 3)
#define STM32_RCC_D2CCIP2_USART16SEL_HSI (3 << 3)
#define STM32_RCC_D2CCIP2_USART16SEL_CSI (4 << 3)
#define STM32_RCC_D2CCIP2_USART16SEL_LSE (5 << 3)
#define STM32_RCC_D2CCIP2_USART16SEL_MASK (7 << 3)
#define STM32_RCC_D2CCIP2_RNGSEL_HSI48 (0 << 8)
#define STM32_RCC_D2CCIP2_RNGSEL_PLL1Q (1 << 8)
#define STM32_RCC_D2CCIP2_RNGSEL_LSE (2 << 8)
#define STM32_RCC_D2CCIP2_RNGSEL_LSI (3 << 8)
#define STM32_RCC_D2CCIP2_RNGSEL_MASK (3 << 8)
#define STM32_RCC_D2CCIP2_LPTIM1SEL_PCLK (0 << 28)
#define STM32_RCC_D2CCIP2_LPTIM1SEL_PLL2 (1 << 28)
#define STM32_RCC_D2CCIP2_LPTIM1SEL_PLL3 (2 << 28)
#define STM32_RCC_D2CCIP2_LPTIM1SEL_LSE (3 << 28)
#define STM32_RCC_D2CCIP2_LPTIM1SEL_LSI (4 << 28)
#define STM32_RCC_D2CCIP2_LPTIM1SEL_PER (5 << 28)
#define STM32_RCC_D2CCIP2_LPTIM1SEL_MASK (7 << 28)
#define STM32_RCC_CSR_LSION BIT(0)
#define STM32_RCC_CSR_LSIRDY BIT(1)

#define STM32_SYSCFG_PMCR REG32(STM32_SYSCFG_BASE + 0x04)
#define STM32_SYSCFG_EXTICR(n) REG32(STM32_SYSCFG_BASE + 8 + 4 * (n))

/* Peripheral bits for APB1ENR regs */
#define STM32_RCC_PB1_LPTIM1 BIT(9)

/* Peripheral bits for APB2ENR regs */
#define STM32_RCC_PB2_TIM1 BIT(0)
#define STM32_RCC_PB2_TIM2 BIT(1)
#define STM32_RCC_PB2_USART1 BIT(4)
#define STM32_RCC_PB2_SPI1 BIT(12)
#define STM32_RCC_PB2_SPI4 BIT(13)
#define STM32_RCC_PB2_TIM15 BIT(16)
#define STM32_RCC_PB2_TIM16 BIT(17)
#define STM32_RCC_PB2_TIM17 BIT(18)

/* Peripheral bits for AHB1/2/3/4ENR regs */
#define STM32_RCC_HB1_DMA1 BIT(0)
#define STM32_RCC_HB1_DMA2 BIT(1)
#define STM32_RCC_HB3_MDMA BIT(0)
#define STM32_RCC_HB4_BDMA BIT(21)

/* Peripheral bits for RCC_APB/AHB and DBGMCU regs */
#define STM32_RCC_PB2_USART1 BIT(4)

/* Reset causes definitions */
#define STM32_RCC_RESET_CAUSE STM32_RCC_RSR
#define RESET_CAUSE_WDG (BIT(28) | BIT(26))
#define RESET_CAUSE_SFT BIT(24)
#define RESET_CAUSE_POR BIT(23)
#define RESET_CAUSE_PIN BIT(22)
#define RESET_CAUSE_OTHER                                                      \
	(BIT(31) | BIT(30) | BIT(29) | BIT(28) | BIT(27) | BIT(26) | BIT(25) | \
	 BIT(24) | BIT(23) | BIT(22) | BIT(21) | BIT(20) | BIT(19) | BIT(18) | \
	 BIT(17))
#define RESET_CAUSE_RMVF BIT(16)

