FrameworkComputer/EmbeddedController/chip/stm32/registers-stm32h7.h
/* Power cause in PWR CPUCR register (Standby&Stop modes) */
#define STM32_PWR_RESET_CAUSE STM32_PWR_CPUCR
#define STM32_PWR_RESET_CAUSE_CLR STM32_PWR_CPUCR
#define RESET_CAUSE_SBF BIT(6)
#define RESET_CAUSE_SBF_CLR BIT(9)

/* --- Watchdogs --- */

/* --- Real-Time Clock --- */
#define STM32_RTC_TR REG32(STM32_RTC_BASE + 0x00)
#define STM32_RTC_DR REG32(STM32_RTC_BASE + 0x04)
#define STM32_RTC_CR REG32(STM32_RTC_BASE + 0x08)
#define STM32_RTC_CR_BYPSHAD BIT(5)
#define STM32_RTC_CR_ALRAE BIT(8)
#define STM32_RTC_CR_ALRAIE BIT(12)
#define STM32_RTC_ISR REG32(STM32_RTC_BASE + 0x0C)
#define STM32_RTC_ISR_ALRAWF BIT(0)
#define STM32_RTC_ISR_RSF BIT(5)
#define STM32_RTC_ISR_INITF BIT(6)
#define STM32_RTC_ISR_INIT BIT(7)
#define STM32_RTC_ISR_ALRAF BIT(8)
#define STM32_RTC_PRER REG32(STM32_RTC_BASE + 0x10)
#define STM32_RTC_PRER_A_MASK (0x7f << 16)
#define STM32_RTC_PRER_S_MASK (0x7fff << 0)
#define STM32_RTC_WUTR REG32(STM32_RTC_BASE + 0x14)
#define STM32_RTC_CALIBR REG32(STM32_RTC_BASE + 0x18)
#define STM32_RTC_ALRMAR REG32(STM32_RTC_BASE + 0x1C)
#define STM32_RTC_ALRMBR REG32(STM32_RTC_BASE + 0x20)
#define STM32_RTC_WPR REG32(STM32_RTC_BASE + 0x24)
#define STM32_RTC_SSR REG32(STM32_RTC_BASE + 0x28)
#define STM32_RTC_TSTR REG32(STM32_RTC_BASE + 0x30)
#define STM32_RTC_TSDR REG32(STM32_RTC_BASE + 0x34)
#define STM32_RTC_TAFCR REG32(STM32_RTC_BASE + 0x40)
#define STM32_RTC_ALRMASSR REG32(STM32_RTC_BASE + 0x44)
#define STM32_RTC_BACKUP(n) REG32(STM32_RTC_BASE + 0x50 + 4 * (n))

#define STM32_BKP_DATA(n) STM32_RTC_BACKUP(n)
#define STM32_BKP_BYTES 128

/* --- SPI --- */

/* The SPI controller registers */
struct stm32_spi_regs {
	uint32_t cr1;
	uint32_t cr2;
	uint32_t cfg1;
	uint32_t cfg2;
	uint32_t ier;
	uint32_t sr;
	uint32_t ifcr;
	uint32_t _pad0;
	uint32_t txdr;
	uint32_t _pad1[3];
	uint32_t rxdr;
	uint32_t _pad2[3];
	uint32_t crcpoly;
	uint32_t rxcrcr;
	uint32_t txcrcr;
	uint32_t udrdr;
};
/* Must be volatile, or compiler optimizes out repeated accesses */
typedef volatile struct stm32_spi_regs stm32_spi_regs_t;

#define STM32_SPI1_REGS ((stm32_spi_regs_t *)STM32_SPI1_BASE)
#define STM32_SPI2_REGS ((stm32_spi_regs_t *)STM32_SPI2_BASE)
#define STM32_SPI3_REGS ((stm32_spi_regs_t *)STM32_SPI3_BASE)
#define STM32_SPI4_REGS ((stm32_spi_regs_t *)STM32_SPI4_BASE)

#define STM32_SPI_CR1_SPE BIT(0)
#define STM32_SPI_CR1_CSTART BIT(9)
#define STM32_SPI_CR1_SSI BIT(12)
#define STM32_SPI_CR1_DIV(div) ((div) << 28)
#define STM32_SPI_CFG1_DATASIZE(n) (((n)-1) << 0)
#define STM32_SPI_CFG1_FTHLV(n) (((n)-1) << 5)
#define STM32_SPI_CFG1_UDRCFG_CONST (0 << 9)
#define STM32_SPI_CFG1_UDRCFG_LAST_RX (1 << 9)
#define STM32_SPI_CFG1_UDRCFG_LAST_TX (2 << 9)
#define STM32_SPI_CFG1_UDRDET_BEGIN_FRM (0 << 11)
#define STM32_SPI_CFG1_UDRDET_END_FRM (1 << 11)
#define STM32_SPI_CFG1_UDRDET_BEGIN_SS (2 << 11)
#define STM32_SPI_CFG1_RXDMAEN BIT(14)
#define STM32_SPI_CFG1_TXDMAEN BIT(15)
#define STM32_SPI_CFG1_CRCSIZE(n) (((n)-1) << 16)
#define STM32_SPI_CFG2_MSTR BIT(22)
#define STM32_SPI_CFG2_SSM BIT(26)
#define STM32_SPI_CFG2_AFCNTR BIT(31)

#define STM32_SPI_SR_RXNE BIT(0)
#define STM32_SPI_SR_UDR BIT(5)
#define STM32_SPI_SR_FRLVL (3 << 13)
#define STM32_SPI_SR_TXC BIT(12)

/* --- Debug --- */
#define STM32_DBGMCU_APB3FZ REG32(STM32_DBGMCU_BASE + 0x34)
#define STM32_DBGMCU_APB1LFZ REG32(STM32_DBGMCU_BASE + 0x3C)
#define STM32_DBGMCU_APB1HFZ REG32(STM32_DBGMCU_BASE + 0x44)
#define STM32_DBGMCU_APB2FZ REG32(STM32_DBGMCU_BASE + 0x4C)
#define STM32_DBGMCU_APB4FZ REG32(STM32_DBGMCU_BASE + 0x54)
/* Alias */
#define STM32_DBGMCU_APB1FZ STM32_DBGMCU_APB1LFZ

/* --- Flash --- */
#define STM32_FLASH_REG(bank, offset) \
	REG32(((bank) ? 0x100 : 0) + STM32_FLASH_REGS_BASE + (offset))

#define STM32_FLASH_ACR(bank) STM32_FLASH_REG(bank, 0x00)
#define STM32_FLASH_ACR_LATENCY_SHIFT (0)
#define STM32_FLASH_ACR_LATENCY_MASK (7 << STM32_FLASH_ACR_LATENCY_SHIFT)
#define STM32_FLASH_ACR_WRHIGHFREQ_85MHZ (0 << 4)
#define STM32_FLASH_ACR_WRHIGHFREQ_185MHZ (1 << 4)
#define STM32_FLASH_ACR_WRHIGHFREQ_285MHZ (2 << 4)
#define STM32_FLASH_ACR_WRHIGHFREQ_385MHZ (3 << 4)

#define STM32_FLASH_KEYR(bank) STM32_FLASH_REG(bank, 0x04)
#define FLASH_KEYR_KEY1 0x45670123
#define FLASH_KEYR_KEY2 0xCDEF89AB
#define STM32_FLASH_OPTKEYR(bank) STM32_FLASH_REG(bank, 0x08)
#define FLASH_OPTKEYR_KEY1 0x08192A3B
#define FLASH_OPTKEYR_KEY2 0x4C5D6E7F
#define STM32_FLASH_CR(bank) STM32_FLASH_REG(bank, 0x0C)
#define FLASH_CR_LOCK BIT(0)
#define FLASH_CR_PG BIT(1)
#define FLASH_CR_SER BIT(2)
#define FLASH_CR_BER BIT(3)
#define FLASH_CR_PSIZE_BYTE (0 << 4)
#define FLASH_CR_PSIZE_HWORD (1 << 4)
#define FLASH_CR_PSIZE_WORD (2 << 4)
#define FLASH_CR_PSIZE_DWORD (3 << 4)
#define FLASH_CR_PSIZE_MASK (3 << 4)
#define FLASH_CR_FW BIT(6)
#define FLASH_CR_STRT BIT(7)
#define FLASH_CR_SNB(sec) (((sec)&0x7) << 8)
#define FLASH_CR_SNB_MASK FLASH_CR_SNB(0x7)
#define STM32_FLASH_SR(bank) STM32_FLASH_REG(bank, 0x10)
#define FLASH_SR_BUSY BIT(0)
#define FLASH_SR_WBNE BIT(1)
#define FLASH_SR_QW BIT(2)
#define FLASH_SR_CRC_BUSY BIT(3)
#define FLASH_SR_EOP BIT(16)
#define FLASH_SR_WRPERR BIT(17)
#define FLASH_SR_PGSERR BIT(18)
#define FLASH_SR_STRBERR BIT(19)
#define FLASH_SR_INCERR BIT(21)
#define FLASH_SR_OPERR BIT(22)
#define FLASH_SR_RDPERR BIT(23)
#define FLASH_SR_RDSERR BIT(24)
#define FLASH_SR_SNECCERR BIT(25)
#define FLASH_SR_DBECCERR BIT(26)
#define FLASH_SR_CRCEND BIT(27)
#define STM32_FLASH_CCR(bank) STM32_FLASH_REG(bank, 0x14)
#define FLASH_CCR_ERR_MASK                                      \
	(FLASH_SR_WRPERR | FLASH_SR_PGSERR | FLASH_SR_STRBERR | \
	 FLASH_SR_INCERR | FLASH_SR_OPERR | FLASH_SR_RDPERR |   \
	 FLASH_SR_RDSERR | FLASH_SR_SNECCERR | FLASH_SR_DBECCERR)
#define STM32_FLASH_OPTCR(bank) STM32_FLASH_REG(bank, 0x18)
#define FLASH_OPTCR_OPTLOCK BIT(0)
#define FLASH_OPTCR_OPTSTART BIT(1)
#define STM32_FLASH_OPTSR_CUR(bank) STM32_FLASH_REG(bank, 0x1C)
#define STM32_FLASH_OPTSR_PRG(bank) STM32_FLASH_REG(bank, 0x20)
#define FLASH_OPTSR_BUSY BIT(0) /* only in OPTSR_CUR */
#define FLASH_OPTSR_RDP_MASK (0xFF << 8)
#define FLASH_OPTSR_RDP_LEVEL_0 (0xAA << 8)
/* RDP Level 1: Anything but 0xAA/0xCC */
#define FLASH_OPTSR_RDP_LEVEL_1 (0x00 << 8)
#define FLASH_OPTSR_RDP_LEVEL_2 (0xCC << 8)
#define FLASH_OPTSR_RSS1 BIT(26)
#define FLASH_OPTSR_RSS2 BIT(27)
#define STM32_FLASH_OPTCCR(bank) STM32_FLASH_REG(bank, 0x24)
#define STM32_FLASH_PRAR_CUR(bank) STM32_FLASH_REG(bank, 0x28)
#define STM32_FLASH_PRAR_PRG(bank) STM32_FLASH_REG(bank, 0x2C)
#define STM32_FLASH_SCAR_CUR(bank) STM32_FLASH_REG(bank, 0x30)
#define STM32_FLASH_SCAR_PRG(bank) STM32_FLASH_REG(bank, 0x34)
#define STM32_FLASH_WPSN_CUR(bank) STM32_FLASH_REG(bank, 0x38)
#define STM32_FLASH_WPSN_PRG(bank) STM32_FLASH_REG(bank, 0x3C)
#define STM32_FLASH_BOOT_CUR(bank) STM32_FLASH_REG(bank, 0x40)
#define STM32_FLASH_BOOT_PRG(bank) STM32_FLASH_REG(bank, 0x44)
#define STM32_FLASH_CRC_CR(bank) STM32_FLASH_REG(bank, 0x50)
#define STM32_FLASH_CRC_SADDR(bank) STM32_FLASH_REG(bank, 0x54)
#define STM32_FLASH_CRC_EADDR(bank) STM32_FLASH_REG(bank, 0x58)
#define STM32_FLASH_CRC_DATA(bank) STM32_FLASH_REG(bank, 0x5C)
#define STM32_FLASH_ECC_FA(bank) STM32_FLASH_REG(bank, 0x60)

/* --- External Interrupts --- */
#define STM32_EXTI_RTSR1 REG32(STM32_EXTI_BASE + 0x00)
#define STM32_EXTI_FTSR1 REG32(STM32_EXTI_BASE + 0x04)
#define STM32_EXTI_SWIER1 REG32(STM32_EXTI_BASE + 0x08)
#define STM32_EXTI_D3PMR1 REG32(STM32_EXTI_BASE + 0x0C)
#define STM32_EXTI_D3PCR1L REG32(STM32_EXTI_BASE + 0x10)
#define STM32_EXTI_D3PCR1H REG32(STM32_EXTI_BASE + 0x14)
#define STM32_EXTI_RTSR2 REG32(STM32_EXTI_BASE + 0x20)
#define STM32_EXTI_FTSR2 REG32(STM32_EXTI_BASE + 0x24)
#define STM32_EXTI_SWIER2 REG32(STM32_EXTI_BASE + 0x28)
#define STM32_EXTI_D3PMR2 REG32(STM32_EXTI_BASE + 0x2C)
#define STM32_EXTI_D3PCR2L REG32(STM32_EXTI_BASE + 0x30)
#define STM32_EXTI_D3PCR2H REG32(STM32_EXTI_BASE + 0x34)
#define STM32_EXTI_RTSR3 REG32(STM32_EXTI_BASE + 0x40)
#define STM32_EXTI_FTSR3 REG32(STM32_EXTI_BASE + 0x44)
#define STM32_EXTI_SWIER3 REG32(STM32_EXTI_BASE + 0x48)
#define STM32_EXTI_D3PMR3 REG32(STM32_EXTI_BASE + 0x4C)
#define STM32_EXTI_D3PCR3L REG32(STM32_EXTI_BASE + 0x50)
#define STM32_EXTI_D3PCR3H REG32(STM32_EXTI_BASE + 0x54)
#define STM32_EXTI_CPUIMR1 REG32(STM32_EXTI_BASE + 0x80)
#define STM32_EXTI_CPUIER1 REG32(STM32_EXTI_BASE + 0x84)
#define STM32_EXTI_CPUPR1 REG32(STM32_EXTI_BASE + 0x88)
#define STM32_EXTI_CPUIMR2 REG32(STM32_EXTI_BASE + 0x90)
#define STM32_EXTI_CPUIER2 REG32(STM32_EXTI_BASE + 0x94)
#define STM32_EXTI_CPUPR2 REG32(STM32_EXTI_BASE + 0x98)
#define STM32_EXTI_CPUIMR3 REG32(STM32_EXTI_BASE + 0xA0)
#define STM32_EXTI_CPUIER3 REG32(STM32_EXTI_BASE + 0xA4)
#define STM32_EXTI_CPUPR3 REG32(STM32_EXTI_BASE + 0xA8)
/* Aliases */
#define STM32_EXTI_IMR STM32_EXTI_CPUIMR1
#define STM32_EXTI_EMR STM32_EXTI_CPUIMR1
#define STM32_EXTI_RTSR STM32_EXTI_RTSR1
#define STM32_EXTI_FTSR STM32_EXTI_FTSR1
#define STM32_EXTI_SWIER STM32_EXTI_SWIER1
#define STM32_EXTI_PR STM32_EXTI_CPUPR1

